{"pages":[{"title":"Hutman Concrete5 Documentation","text":"Hutman Documentation","tags":"","url":"index.html"},{"title":"Developers Guide","text":"","tags":"","url":"Developers_Guide.html"},{"title":"Overview","text":"Concepts Blocks Blocks are the smallest presentational unit in concrete5. They are meant to be added to a page, and to consist primarily of visible content. Each time a block is added to a page, a new Block object is created. This same block object may be aliased to different pages and versions of pages. Block Types Each block has a BlockType object associated with it, which tells the system what type of data it stores. Each block must be of a certain type (e.g. “slideshow,” “content,” “page list,” etc…) Block Instance-Specific Data A combination of these two types of data gives us the block’s instance-specific data. This is information about the particular instance of the block that is only relevant to the block’s type. For example, if you’re dealing with the Youtube video block, it’s instance-specific data is the address of the video you want to display, and its name. Basically, any information displayed a block’s add or edit interface is its instance-specific data. Code Locations All of the necessary block files are contained within one directory, located in one of several places concrete\/blocks\/ packages\/some_package\/blocks\/ application\/blocks\/ The name of the directory that stores the code files in these locations must match that of the block type handle. Overrides Any file in the first two locations above can be overridden by the same file in the third location. This lets sites override presentational and controller logic for custom applications and display, without forking core code bases or packages acquired from the marketplace.","tags":"","url":"Blocks\/Overview.html"},{"title":"Directory Setup","text":"A block's directory can contain the following items. A Database Definition db.xml This is a file named db.xml, in the Doctrine XML Format. This file describes the schema of the block in a way that can be easily read and understood. The schema can also be altered later and refreshed through the dashboard or a package update if the block is installed using a package. Multiple tables can contained within this file. The only requirement for the table is that the core block type table must contain a column named bID, which is an unsigned integer. An Icon icon.png A block's icon is displayed in the Add Block window. This is a 50x50 PNG named &quot;icon.png&quot;. Controller controller.php This file extends the BlockController object. You can learn more about this file in the Controller section of the Blocks Documentation Core Templates add.php This file is rendered when the block is added. edit.php This file is rendered when the block is edited. view.php This file is rendered when the block is viewed in a page. composer.php (optional) An optional file that is rendered when the block is displayed within the composer view. Stylesheet view.css Block specific styles, will be included on every page that this block is added to.","tags":"","url":"Blocks\/Directory_Setup.html"},{"title":"Controller","text":"A block's controller can contain the following properties and methods. Properties $btTable (required) This is the core block type table that you are saving data into. $btExportTables If your block uses more than one table. This is an array of tables that are connected to this block, this is used for the duplicate function. $btInterfaceWidth (default 400) $btInterfaceHeight (default 400) These variables define, in pixels, the width and height of your block's window when added or edited. $btSupportsInlineAdd (default false) $btSupportsInlineEdit (default false) These variables can be set to true if this block supports inline add\/edit functionality (like the Content block). $btDefaultSet This variable can be set to defind the Block Set this Block Type should display in. If none is defined it will display in the &quot;Other&quot; Set. $btCacheBlockRecord (default true) Allow the block record to be cached. $btCacheBlockOutput (default false) Allow the block output to be cached. $btCacheBlockOutputLifetime (default 0) Time, in minutes, to cache the block's output. $btCacheBlockOutputOnPost (default false) Allow the block output to be cached after post. $btCacheBlockOutputForRegisteredUsers Allow the block output to be cached for Registered Users. $btIgnorePageThemeGridFrameworkContainer (default false) Define if this block should always ignore the area's grid framework container. $helpers (default ['form']) If your block needs helpers, this is an array of helpers to be included. $supportSavingNullValues (default false) Set this to true if the data sent to the save\/performSave methods can contain NULL values that should be persisted. Methods getBlockTypeName() Returns the name of the block's type. getBlockTypeDescription() Returns the description of the block type. on_start() Fires automatically when a block is interacted with. If you're thinking of putting something in the block's &quot;__construct()&quot; method, use this instead. It is run only when necessary and is less likely to be a performance drain. on_page_view() This function is automatically run when the block is viewed from within a page. add() This function is automatically run when the block is placed in add mode. edit() This function is automatically run when the block is edited. validate() This function is automatically run when the block is submitted to be saved and can return validation errors if needed. save($args) $args is an associated array, and is usually filled with the contents of the $_POST array (when either added or saved.) The BlockController save() method will actually rarely need to be overridden, as it inspects the columns of the block's core database table and looks through the $_POST to find matching columns, and saves data automatically. registerViewAssets($outputContent = '') This function is automatically run when the block is viewed and can be used to include assets for the view. view() This function is automatically run when the block is viewed. set($key, $value) Takes a string $key and a mixed $value, and makes a variable of that name available from within a block's view, add or edit template. This is typically used within the add(), edit() or view() function. render($view) Renders a view that's in the block's folder. Does not require .php on the end of the filename. duplicate($newBlockID) Run automatically when a block is duplicated. This most likely happens when a block that is in an approved version is updated. A block controller may override this function to provide specific duplicate-only functionality. delete() Automatically run when a block is deleted. This removes the special data from the block's specific database table. If a block needs to do more than this this method should be overridden.","tags":"","url":"Blocks\/Controller.html"},{"title":"Block Types","text":"From time to time you may find yourself access a BlockType object. Here are the various methods available from that object. Load a Block Type Object $blockType = \\Concrete\\Core\\Block\\BlockType::getByID($id) $blockType = \\Concrete\\Core\\Block\\BlockType::getByHandle($blockTypeHandle) Returns a BlockType object given a passed block type ID or handle. Methods \\Concrete\\Core\\Block\\BlockType::installBlockType($btHandle, $pkg) Installs a block type from a particular package. Useful in a package's install() method. $blockType-&gt;isCoreBlockType() Returns true if the block type ships with concrete5. $blockType-&gt;getPackageID() Returns the package ID of the block type, or zero if the block type ships with concrete5 or is custom. $blockType-&gt;getPackageHandle() Returns the package handle of the block type, or null if the block type ships with concrete5 or is custom. $blockType-&gt;getCount() Returns the number of unique instances of this block type. $blockType-&gt;getBlockTypeDescription() Returns the description of the block type. $blockType-&gt;getBlockTypeInterfaceWidth() Returns the width that the block thinks it needs to be, when adding or editing. $blockType-&gt; getBlockTypeInterfaceHeight() Returns the height that the block thinks it needs to be, when adding or editing. $blockType-&gt;getBlockTypeCustomTemplates() Returns an array of custom templates. Checks the core block type directory, the local overrides directory, and any packages to see if they specify custom templates for this block type. $controller = $blockType-&gt;getController() Returns the extended BlockController for the particular BlockType object. $blockType-&gt;getBlockTypePath() Returns a path to where the block type's files are located. $blockType-&gt;inc($file, $args = array()) Extracts all items passed through $args, and then includes the file from either the local directory or the core directory. $blockType-&gt;delete() Deletes the block type. Only removes the block type from the BlockTypes table, not any of the information in the other tables. $blockType-&gt;refresh() Refreshes the block type's database schema (stored in db.xml). $blockType-&gt;render($view) Renders a particular view of a block type, using the public $controller variable as the block type's controller Embedding Blocks in a Page Template There are times when you might want to use a block's functionality within a page without having that block editable through the CMS. You can render a block with parameters as though it were added through the CMS by coding it directly into a page template. Example 1: Hard-Coding Tags Block $bt = \\Concrete\\Core\\Block\\BlockType::getByHandle('tags'); $c = \\Concrete\\Core\\Page\\Page::getByID('\/path\/to\/target\/page'); $bt-&gt;controller-&gt;set('title', t('Tags')); $bt-&gt;controller-&gt;set('target', $c); $bt-&gt;render(); Example 2: Hard-Coding Auto-Nav Block with Custom Template Render a breadcrumb navigation using the Auto-Nav block with certain options, and the built-in Breadcrumb Auto-Nav custom tempate. $bt = \\Concrete\\Core\\Block\\BlockType::getByHandle('autonav'); $bt-&gt;controller-&gt;orderBy = 'display_asc'; $bt-&gt;controller-&gt;displayPages = 'top'; $bt-&gt;controller-&gt;displaySubPages = 'relevant_breadcrumb'; $bt-&gt;controller-&gt;displaySubPageLevels = 'all'; $bt-&gt;render('templates\/breadcrumb');","tags":"","url":"Blocks\/Block_Types.html"},{"title":"Standard Widgets","text":"concrete5's form helper makes it easy to add form widgets to your single pages and custom blocks, and several advantages to writing full HTML tags. Data persistence on POST: when submitting the core form helpers, their data will remain as originally entered, without having to worry about checking $_REQUEST variables. This is even the case for more complex form elements like radio buttons and checkbox lists. Attractive styling. Form elements in the block add and edit dialogs will better adhere to concrete5 design guidelines when they are output using the core form helpers. Do more with less. Once you learn the syntax, writing forms using these helpers can save you a lot of time and code. Loading the Helper You can load the concrete5 form helper using the following simple code $app = \\Concrete\\Core\\Support\\Facade\\Application::getFacadeApplication(); $form = $app-&gt;make('helper\/form'); The $form variable now contains an instance of the FormHelper class. Arguments While each form helper function ultimately displays a different HTML tag, most take common arguments. Here is their explanation: $name Name of the field. Oftentimes will set the ID of the field to the same valueOrMiscFields. $valueOrMiscFields Initial field valueOrMiscFields. Typically optional. $miscFields An associative array of additional attributes to be added to the input element. (e.g. array('style' =&gt; 'width: 100%')). $additionalClasses A string of additional classes to be added to the class attribute on the tag. Note: In most cases, only the $name of the field is a required function argument. Other items are optional. Additionally, if the $valueOrMiscFields is left blank, the $miscFields field can usually be specified as the second argument to the helper. Methods $form-&gt;hidden($name, $valueOrMiscFields) Creates a hidden form element. $form-&gt;label($name, $valueOrMiscFields) Creates a label for a form element. The $name parameter must match the $name of another form element. $form-&gt;text($name, $valueOrMiscFields, $miscFields) Creates a text input element. $form-&gt;number($name, $valueOrMiscFields, $miscFields) Creates a number input element. $form-&gt;email($name, $valueOrMiscFields, $miscFields) Creates an email input element. $form-&gt;telephone($name, $valueOrMiscFields, $miscFields) Creates a telephone input element. $form-&gt;url($name, $valueOrMiscFields, $miscFields) Creates a url input element. $form-&gt;password($name, $valueOrMiscFields, $tagAttribute) Outputs a password field. $form-&gt;textarea($name, $valueOrMiscFields, $miscFields) Outputs a textarea form element. $form-&gt;select($name, $optionValues, $valueOrMiscFields, $miscFields) Outputs a select menu. The $options argument is a PHP array. The keys of the array will be used as the select option valueOrMiscFieldss, while the array valueOrMiscFieldss will be displayed in the menu. The $valueOrMiscFields parameter controls the initially checked select element. $form-&gt;selectCountry($key, $selectedCountryCode, $configuration = [], $miscFields = []) Renders a select menu to choose a Country. @param string $key The name of the element. If $key denotes an array, the ID will start with $key but will have a progressive unique number added; if $key does not denotes an array, the ID attribute will be $key. @param string $selectedCountryCode the code of the Country to be initially selected @param array $configuration Configuration options. Supported keys are: 'required': users must choose a Country? 'allowedCountries': an array containing a list of acceptable Country codes. If not set, all the countries will be selectable. 'linkStateProvinceField': set to true to look for text fields that have a &quot;data-countryfield&quot; attribute with the same valueOrMiscFields as this Country field name (updating the Country select will automatically update the State\/Province list). @param array $miscFields Additional fields appended to the element (a hash array of attributes name =&gt; valueOrMiscFields), possibly including 'class' $form-&gt;checkbox($name, $value, $isChecked, $miscFields) Outputs a checkbox. The $isChecked boolean controls whether the checkbox is initially checked or not. $form-&gt;radio($name, $value, $checkedValueOrMiscFields, $miscFields) Outputs a radio button. The $buttonValue argument controls the valueOrMiscFields of this particular radio button. The second $valueOrMiscFields argument contains the initial valueOrMiscFields we wish to check, in a series of radio buttons. $form-&gt;file($name, $tagAttribute) Outputs a file upload field. $form-&gt;submit($name, $valueOrMiscFields, $miscFields, $additionalClasses) Outputs an input type=&quot;submit&quot;. $form-&gt;button($name, $valueOrMiscFields, $miscFields, $additionalClasses) Outputs an input type=&quot;button&quot;.","tags":"","url":"Forms\/Standard_Widgets.html"},{"title":"Concrete5 Widgets","text":"In addition to standard form widgets, concrete5 provides a myriad of other widgets for linking to pages, selecting pages, selecting users, working with dates, and much much more. In addition to providing widgets that would otherwise take your hours to code yourself. Data persistence on POST: when submitting the core form helpers, their data will remain as originally entered, without having to worry about checking $_REQUEST variables. Do more with less. Once you learn the syntax, writing forms using these helpers can save you a lot of time and code. Calendar Event Selector Color Picker Date Time","tags":"","url":"Forms\/Concrete5_Widgets\/index.html"},{"title":"Calendar Event Selector","text":"Loading The Helper $app = \\Concrete\\Core\\Support\\Facade\\Application::getFacadeApplication(); $af = $app-&gt;make('helper\/form\/calendar_event_selector'); Usage $af-&gt;selectEvent($calendar, $fieldName, $eventID = false); @param object $calendar - Calendar object. @param string $fieldName - Form field name. @param int $eventID - Selected eventID","tags":"","url":"Forms\/Concrete5_Widgets\/Calendar_Event_Selector.html"},{"title":"Captcha","text":"Loading The Helper $app = \\Concrete\\Core\\Support\\Facade\\Application::getFacadeApplication(); $captcha = $app-&gt;make('helper\/form\/captcha'); The captcha helper lets you integrate an image-based captcha into your forms, to help prevent spam. Uses the third party SecureImage library. Usage $captcha-&gt;display() Displays a dynamically generated image, for use with the captcha input text field. $captcha-&gt;showInput() Creates the text field for that instance of the captcha. This text input element automatically has the name &quot;ccmCaptchaCode&quot; $captcha-&gt;check($field = 'ccmCaptchaCode') Automatically checks the request array for the passed $field. Returns true if the field contains the same text as the current instance of the captcha, false if the captcha has been failed.","tags":"","url":"Forms\/Concrete5_Widgets\/Captcha.html"},{"title":"Color Picker","text":"Loading The Helper $app = \\Concrete\\Core\\Support\\Facade\\Application::getFacadeApplication(); $af = $app-&gt;make('helper\/form\/color'); Usage $af-&gt;output($inputName, $value = null, $options = array()); @param string $name - Form field name. @param string $value - Selected hex color. @param array $options - ??? Not sure what can go in here","tags":"","url":"Forms\/Concrete5_Widgets\/Color_Picker.html"},{"title":"Date Time","text":"Loading The Helper $app = \\Concrete\\Core\\Support\\Facade\\Application::getFacadeApplication(); $dtt = $app-&gt;make('helper\/form\/date_time'); The $dtt Object is now an instance of DateTimeHelper. This helper provides a calendar and an optional time dropdown selector. Useful for selecting dates and date\/time combinations. Usage $dtt-&gt;date($field, $value = null, $calendarAutoStart = true, array $datePickerOptions = array()); @param string $field The field name (will be used as $field parameter in the translate method) @param \\DateTime|string $value The initial value @param bool $calendarAutoStart Set to false to avoid initializing the Javascript calendar @param array $datePickerOptions datepicker properties, see jquery-ui datepicker docs Creates form fields and JavaScript calendar includes for a particular item but includes only calendar controls (no time, so no time-zone conversions will be applied). $dtt-&gt;datetime($field, $value = null, $includeActivation = false, $calendarAutoStart = true, $classes = null, $timeResolution = 60, array $datePickerOptions = array()); @param string $field The field prefix (will be used as $field parameter in the translate method) @param \\DateTime|string $value The initial value @param bool $includeActivation Set to true to include a checkbox to enable\/disable the date\/time fields @param bool $calendarAutoStart Set to false to avoid initializing the Javascript calendar @param string $classes A list of space-separated classes to add to the ui-datepicker-div container @param int $timeResolution The time resolution in seconds (60 means we won't ask seconds) @param array $datePickerOptions datepicker properties, see jquery-ui datepicker docs Creates form fields and JavaScript calendar includes for a particular item (date\/time string representations will be converted from the user system-zone to the time-zone). $dtt-&gt;translate($field, $arr = null, $asDateTime = false); @param string $field The name of the field to translate @param array $arr The array containing the value. If null (default) we'll use $_POST @param bool $asDateTime Set to true to get a DateTime object, false (default) for a string representation Takes a &quot;field&quot; and grabs all the corresponding disparate fields from $_POST and translates into a timestamp. If $field has both date and time, the resulting value will be converted from the user timezone to the system timezone. If $field has only date and not time, no timezone conversion will occur.","tags":"","url":"Forms\/Concrete5_Widgets\/Date_Time.html"},{"title":"Page Selector","text":"Loading The Helper Provides an easy way to select a page from a combination sitemap\/search form. Saves a numeric page ID to a hidden form element. $app = \\Concrete\\Core\\Support\\Facade\\Application::getFacadeApplication(); $pageSelector = $app-&gt;make('helper\/form\/page_selector'); Usage $pageSelector-&gt;selectPage($fieldName, $cID = false); @param string $fieldName The field name @param bool|int $cID The ID of the already selected page Creates form fields and JavaScript page chooser for choosing a page. For use with inclusion in blocks. $pageSelector-&gt;selectMultipleFromSitemap($field, $pages = array(), $startingPoint = 'HOME_CID', $filters = array()); @param string $field The field name @param array $pages An array of IDs of the already selected pages @param int $startingPoint Page ID of the parent page for displaying the sitemap @param array $filters - ??? Not sure what can go in here","tags":"","url":"Forms\/Concrete5_Widgets\/Page_Selector.html"},{"title":"Rating","text":"Loading The Helper $app = \\Concrete\\Core\\Support\\Facade\\Application::getFacadeApplication(); $rt = $app-&gt;make('helper\/form\/rating'); Usage $rt-&gt;rating($name, $value = null, $includeJS = true); @param string $name - The field name @param string $value - The selected value @param boolean $includeJS - Should this include javascript","tags":"","url":"Forms\/Concrete5_Widgets\/Rating.html"},{"title":"User Selector","text":"Loading The Helper Provides an interface for selecting a single or multiple users. Saves to a hidden form element. $app = \\Concrete\\Core\\Support\\Facade\\Application::getFacadeApplication(); $uh = $app-&gt;make('helper\/form\/user_selector'); Usage $uh-&gt;selectUser($fieldName, $uID = false); @param string $fieldName - the field name @param bool|int $uID - the ID of the user to be initially selected Build the HTML to be placed in a page to choose a user using a popup dialog. $uh-&gt;quickSelect($fieldName, $uID = false, $miscFields = []); @param string $fieldName - the name of the field @param int|false $uID - the ID of the user to be initially selected @param array $miscFields - additional fields appended to the hidden input element (a hash array of attributes name =&gt; value), possibly including 'class' Build the HTML to be placed in a page to choose a user using a select with users pupulated dynamically with ajax requests. $uh-&gt;selectMultipleUsers($field, $pages = array(), $startingPoint = 'HOME_CID', $filters = array()); @param string $field - the field name @param array $pages - an array of IDs of the already selected pages @param int $startingPoint - page ID of the parent page for displaying the sitemap @param array $filters - ??? Not sure what can go in here Build the HTML to be placed in a page to choose multiple users using a popup dialog.","tags":"","url":"Forms\/Concrete5_Widgets\/User_Selector.html"},{"title":"JSON","text":"The JSON helper is useful when working with data that needs to be decoded from or encoded to the JSON format. concrete5 uses JSON to communicate between the dashboard sitemap and the backend, and to\/from the concrete5 marketplace. Loading the Helper $app = \\Concrete\\Core\\Support\\Facade\\Application::getFacadeApplication(); $json = $app-&gt;make('helper\/json'); Methods $json-&gt;decode($string, $as_array = false); @param string $string The string to be json decoded @param boolean $as_array Whether to return the restuls as an array Decodes a string of JSON data into a PHP object or array. By default, the JSON data is decoded into an object. Setting the optional second parameter true will return an associative array. $json-&gt;encode($item); @param mixed $item The item to be json encoded Encodes a PHP object or array $item into a JSON string and returns it.","tags":"","url":"Helpers\/JSON.html"},{"title":"Navigation","text":"Loading the Helper $app = \\Concrete\\Core\\Support\\Facade\\Application::getFacadeApplication(); $nh = $app-&gt;make('helper\/navigation'); Methods $nh-&gt;getCollectionURL($cObj); @param Page $cObj The page object Returns the URL of a collection so that it can be clicked on. $nh-&gt;getLinkToCollection($cObj); @param Page $cObj The page object Returns a link to a page. Note: this always returns a string. $nh-&gt;getTrailToCollection($cObj) @param Page $cObj The page object Returns an array of collections as a breadcrumb to the current page $breadcrumb = $nh-&gt;getTrailToCollection($c); krsort($breadcrumb); foreach ($breadcrumb as $bcpage) { echo '' . $bcpage-&gt;getCollectionName() . ' &gt; '; } echo $c-&gt;getCollectionName(); Returns breadcrumb links: Home &gt; Previous Page &gt; Current Page $nh-&gt;getLogInOutLink() Returns a string containing an HTML link to either the Login page (if the user is not currently logged in) or the Logout page","tags":"","url":"Helpers\/Navigation.html"},{"title":"Text","text":"Loading the Helper $app = \\Concrete\\Core\\Support\\Facade\\Application::getFacadeApplication(); $th = $app-&gt;make('helper\/text'); Methods $th-&gt;encodePath(string $path); URL-encodes collection path. $th-&gt;match(string $pattern, string $value); Determine if a given string matches a given pattern. $th-&gt;slugSafeString(string $handle, int $maxlength = 128); Remove unsafe characters for URL slug. $th-&gt;sanitize(string $string, int $max_length, string $allowed = ''); Strips tags and optionally reduces string to specified length. $th-&gt;email(string $email); Leaves only characters that are valid in email addresses (RFC). $th-&gt;alphanum(string $string); Leaves only characters that are alpha-numeric. $th-&gt;entities(string $v); Always use in place of htmlentites(), so it works with different languages. $th-&gt;decodeEntities(string $v); Decodes html-encoded entities (for instance: from '&gt;' to '&gt;'). $th-&gt;specialchars($v) A concrete5 specific version of htmlspecialchars(). Double encoding is OFF, and the character set is set to your site's. $th-&gt;shorten(string $textStr, int $numChars = 255, string $tail = '…') An alias for shorten(). $th-&gt;shortText(string $textStr, int $numChars = 255, string $tail = '…') Like sanitize, but requiring a certain number characters, and assuming a tail. $th-&gt;camelcase(string $string) Takes a string and turns it into the CamelCase or StudlyCaps version. $th-&gt;twitterAutolink(string $input, int $newWindow, int $withSearch) Automatically add hyperlinks to any twitter style @usernames in a string. $th-&gt;makenice(string $input) Runs a number of text functions, including autolink, nl2br, strip_tags. Assumes that you want simple text comments but with a few niceties. $th-&gt;prettyStripTags($input, $allowedTags = null) Runs strip_tags but ensures that spaces are kept between the stripped tags. $th-&gt;autolink(string $input, bool $newWindow = false, string $defaultProtocol = 'http:\/\/') Scans passed text and automatically hyperlinks any URL inside it. $th-&gt;fnmatch(string $pattern, string $string) A wrapper for PHP's fnmatch() function, which some installations don't have. $th-&gt;uncamelcase(string $string) Takes a CamelCase string and turns it into camel_case. $th-&gt;unhandle(string $string) Takes a handle-based string like &quot;blah_blah&quot; or &quot;blah-blah&quot; or &quot;blah\/blah&quot; and turns it into &quot;Blah Blah&quot;. $th-&gt;handle($handle, bool $leaveSlashes = false) Takes a string and turns it into a handle. $th-&gt;sanitizeFileSystem(string $handle) Takes text and returns it in the &quot;lowercase_and_underscored_with_no_punctuation&quot; format. Tries to be sensible about internationalized characters, converting umlauts, etc… $th-&gt;urlify(string $handle, int $max_length = null, string $locale = '', bool $removeExcludedWords = true) Takes text and returns it in the &quot;lowercase-and-dashed-with-no-punctuation&quot; format. $th-&gt;asciify(string $text, string $locale = '') Takes text and converts it to an ASCII-only string (characters with code between 32 and 127, plus \\t, \\n and \\r). $th-&gt;wordSafeShortText(string $textStr, int $numChars = 255, string $tail = '…') alias of shortenTextWord(). $th-&gt;shortenTextWord($textStr, int $numChars = 255, string $tail = '…') Shortens and sanitizes a string but only cuts at word boundaries. $th-&gt;filterNonAlphaNum(string $val) Strips out non-alpha-numeric characters. $th-&gt;highlightSearch(string $value, string $searchString) Highlights a string within a string with the class ccm-highlight-search. $th-&gt;formatXML($xml) Formats a passed XML string nicely.","tags":"","url":"Helpers\/Text.html"},{"title":"Overview","text":"Accessible through the system section of the dashboard, jobs are ways of automating certain processes available to concrete5. These jobs can be run from the dashboard, or easily cronned and run from the server at specified intervals. Creating Your Own Job Creating your own job is as simple as creating a new class in the Job format, and adding it to the application\/jobs\/ directory in your local web root. This job will then appear on the Jobs page in your site's dashboard, can then be installed and run easily. Create the File In your local application\/jobs\/ directory, create a file in the typical concrete5 handle format. (all lowercase, with underscores separating spaces. e.g. &quot;job_handle.php&quot;) Create a class in this file Within this file, take the name of your file (minus .php) and camelcase it, and use that as your job's class name, while extending the \\Concrete\\Core\\Job\\Job class. class JobHandle extends \\Concrete\\Core\\Job\\Job Specify the Job name and description Within this file, define the method getJobName() and getJobDescription(), with each returning the relevant piece of information about the job. Define the run() function Inside a run() function of your Job, define whatever programming logic you wish to execute when the Job is run. Setup error handling and output Within your run() method, handle errors by using the throw() method and native PHP exception support. Any exceptions that occur within your job will cease the job from running and be reported to the administrator when they next visit the Jobs page in the dashboard. If you would like to return custom output for the status of your job, simply return a string from your run() method. Installing a Job with a Package Addon developers may install Jobs with their packages. To do this, simply include the job file in a jobs\/ directory within the package, and execute the following code from within your package's install() command: Job::installByPackage('job_handle', $pkg); Any jobs installed in this way will automatically be removed if your package is uninstalled. Full Job Example File is: \/packages\/package_name\/jobs\/job_handle.php &lt;?php namespace Concrete\\Package\\PackageName\\Job; class JobHandle extends \\Concrete\\Core\\Job\\Job { public function getJobName() { return t(&quot;Job Name&quot;); } public function getJobDescription() { return t(&quot;Job Description&quot;); } public function run() { \/\/do the functions of the job } }","tags":"","url":"Jobs\/Overview.html"},{"title":"Job Sets","text":"Jobs can be separated into sets in order to run different jobs at different times using a Cron. $jobSet = Concrete\\Core\\Job\\Set::getByID($id); Get the job set by the job set ID. $jobSet = Concrete\\Core\\Job\\Set::getByName($name); Get the job set by the job set Name. $defaultSet = Concrete\\Core\\Job\\Set::getDefault(); Get the Default job set. $jobSet-&gt;getJobSetID(); Get the job set id $jobSet-&gt;getJobSetName(); Get the job set name $jobSet-&gt;getPackageID(); Get the job set package id $jobSet-&gt;getJobSetDisplayName(); Get the job set display name $jobList = $jobSet-&gt;getList(); Get the list of jobs in this job set.","tags":"","url":"Jobs\/Job_Sets.html"},{"title":"Logging","text":"In concrete5, logging something so that it appears in the Dashboard can be as simple as a single line. \\Log::addInfo('This is an informative message'); \\Log::addWarning('Uh oh.'); \\Log::addAlert('Red alert!'); Log::addDebug('This is a debug level.'); This is using the Log facade, which is a static class in the root namespace that automatically instantiates the Concrete\\Core\\Logging\\Logger class with its dependencies. If you import the Log class at the top of your file, you don't have to use the backslash: Severity concrete5's logger implements PSR-3, and is built on the Monolog library. That means it supports the following severities (which are listed here in escalating order.) Debug Info Notice Warning Error Critical Alert Emergency To log a message with a particular severity, simply call Log::addSeverity, concrete5 makes it easy to search by severity in the Dashboard. Logging Objects Need to log an object using the logger? You'll need to change it into a string first. Here's an example of logging the data about Concrete\\Core\\User\\UserInfo object: $ui = \\UserInfo::getByID(1); \\Log::addInfo('Information about the admin user: ' . var_dump_safe($ui, $false)); Why var_dump_safe? Some objects in concrete5 are built from Doctrine ORM, which is a library that makes it easy to work with database data. These objects are extremely large; if you attempt to run a normal var_dump or print_r on them, they will die and possibly crash your PHP session. Instead, use the concrete5-specific var_dump_safe method, with the $echo argument (the second argument) set to false.","tags":"","url":"Logging.html"},{"title":"Mail","text":"Loading the Helper $app = \\Concrete\\Core\\Support\\Facade\\Application::getFacadeApplication(); $mh = $app-&gt;make('helper\/mail'); Plain Text Example $mh-&gt;setSubject('Plain Text Message'); $mh-&gt;from('noreply@domain.com'); $mh-&gt;replyto('noreply@domain.com'); $mh-&gt;to('email@domain.com', 'To Name'); $mh-&gt;cc('email@domain.com', 'To Name'); $mh-&gt;bcc('email@domain.com', 'To Name'); $mh-&gt;setBody('This is my simple message body.'); $mh-&gt;sendMail(); HTML Example $mh-&gt;setSubject('Plain Text Message'); $mh-&gt;from('noreply@domain.com'); $mh-&gt;replyto('noreply@domain.com'); $mh-&gt;to('email@domain.com', 'To Name'); $mh-&gt;cc('email@domain.com', 'To Name'); $mh-&gt;bcc('email@domain.com', 'To Name'); $mh-&gt;setBodyHTML('&lt;p&gt;This is my simple message body.&lt;\/p&gt;'); $mh-&gt;sendMail(); Loading email content from an external template. You may load email content from a template, which will need to be located in the local mail\/ directory. These templates are simply a collection of PHP variables like $body, $subject, and $from. Additional PHP variables can be specified within these variables and then passed through the MailHelper::addParameter method. Template $subject = t(&quot;Template Message&quot;); $body = t(&quot; Dear %s, Your email is: %s Thanks! &quot;, $uName, $uEmail); $mh-&gt;from('noreply@domain.com'); $mh-&gt;replyto('noreply@domain.com'); $mh-&gt;to('email@domain.com', 'To Name'); $mh-&gt;cc('email@domain.com', 'To Name'); $mh-&gt;bcc('email@domain.com', 'To Name'); $mh-&gt;addParameter('uName', 'username'); $mh-&gt;addParameter('uEmail', 'email@domain.com'); $mh-&gt;load('template_name'); $mh-&gt;sendMail(); Methods $mh-&gt;reset() Clean up the instance of this object (reset the class scope variables). $mh-&gt;addParameter(string $key, mixed $val) Adds a parameter for the mail template. $mh-&gt;addAttachment(Concrete\\Core\\Entity\\File\\File $file) Add a File entity as an attachment of the message. $mh-&gt;addAttachmentWithHeaders(Concrete\\Core\\Entity\\File\\File $file, array $headers) @param array $headers Additional headers fo the MIME part. Valid values are: - filename: The name to give to the attachment (it will be used as the filename part of the Content-Disposition header) [default: the filename of the File instance] - mimetype: the main value of the Content-Type header [default: the content type of the file] - disposition: the main value of the Content-Disposition header [default: attachment] - encoding: the value of the Content-Transfer-Encoding header [default: base64] - charset: the charset value of the Content-Type header - boundary: the boundary value of the Content-Type header - id: the value of the Content-ID header (without angular brackets) - description: the value of the Content-Description header - location: the value of the Content-Location header - language: the value of the Content-Language header Add a File entity as an attachment of the message, specifying the headers of the mail MIME part. $mh-&gt;addRawAttachment(string $content, string $filename, string $mimetype = 'application\/octet-stream') Add a mail attachment by specifying its raw binary data. $mh-&gt;addRawAttachmentWithHeaders(string $content, string $filename, array $headers = []) Add a mail attachment by specifying its raw binary data, specifying the headers of the mail MIME part. $mh-&gt;load(string $template, string|null $pkgHandle = null) Load an email template from the \/mail\/ directory. $mh-&gt;setBody(string|false $body) Manually set the plain text body of a mail message (typically the body is set in the template + load method). $mh-&gt;setSubject(string $subject) Manually set the message's subject (typically the body is set in the template + load method). $mh-&gt;setBodyHTML(string|false $html) Manually set the HTML body of a mail message (typically the body is set in the template + load method). $mh-&gt;from(string $email, string|null $name = null) Set the from address on the message. $mh-&gt;to(string $email, string|null $name = null) Add one or more &quot;To&quot; recipients to the message. $mh-&gt;cc(string $email, string|null $name = null) Add one or more &quot;CC&quot; recipients to the message. $mh-&gt;bcc(string $email, string|null $name = null) Add one or more &quot;BCC&quot; recipients to the message. $mh-&gt;replyto(string $email, string|null $name = null) Sets the Reply-To addresses of the message. $mh-&gt;setTesting(bool $testing) Set the testing state (if true the email logging never occurs and sending errors will throw an exception). $mh-&gt;setAdditionalHeaders(array $headers) Set additional message headers. $mh-&gt;sendMail(bool $resetData = true) Sends the email.","tags":"","url":"Mail.html"},{"title":"Overview","text":"Getting the current page Throughout your code, if you wish to grab the object for the currently rendered page, simply execute this code: $page = \\Concrete\\Core\\Page\\Page::getCurrentPage(); This will return the currently rendered page's object. Getting a Page Object by ID $page = \\Concrete\\Core\\Page\\Page::getByID($pageID); Returns the current page based on its id. Getting a Page Object by Path $page = \\Concrete\\Core\\Page\\Page::getByPath('\/path\/to\/page'); Returns the current page based on its path. Methods $page-&gt;getCollectionID() Returns the id for the current page. $page-&gt;getCollectionHandle() Returns the page's handle. $page-&gt;getCollectionName() Returns the page's name. $page-&gt;getCollectionDatePublic() Gets the date a the current version was made public, date formated like: 2009-01-01 00:00:00 $page-&gt;getCollectionDatePublicObject() Returns the \\DateTime instance (or null if the current version doesn't have public date) $page-&gt;getAttribute(string|CollectionKey $akHandle, string|false $displayMode = false) Return the value of the attribute with the handle $akHandle of the currently loaded version (if it's loaded). $page-&gt;getAttributeValueObject($akHandle, $createIfNotExists = false) Return the attribute value object with the handle $akHandle of the currently loaded version (if it's loaded). $page-&gt;getCollectionPath() Returns the path for the current page. $page-&gt;getCollectionLink($appendBaseURL = false) Returns full url for the current page. $page-&gt;getCollectionDescription() Get the description of a page. $page-&gt;getPageTypeID() Returns the Collection Type ID. $page-&gt;getPageTypeHandle() Returns the Collection Type handle. $page-&gt;getPageTemplateID() Returns the Page Template ID. $page-&gt;getPageTemplateHandle() Returns the Page Template handle. $page-&gt;getCollectionThemeID() Returns theme id for the collection. $page-&gt;getJSONObject() Return a representation of the Page object as something easily serializable. $page-&gt;isEditMode() Is the page in edit mode. $page-&gt;isExternalLink() Checks if a page is an external link. $page-&gt;getCollectionParentID() Get the Parent cID from a page by using a cID. $page-&gt;getNumChildren() $page-&gt;getNumChildrenDirect() $page-&gt;getFirstChild(string $sortColumn = 'cDisplayOrder asc') Returns the first child of the current page, or null if there is no child. $page-&gt;getCollectionChildrenArray($oneLevelOnly) $page-&gt;getCollectionChildren() Returns the immediate children of the current page. $page-&gt;addBlock(BlockType $bt, Area $a, array $data) Adds a block to the page. $page-&gt;getBlocks(string|false $arHandle = false) List the blocks in the currently loaded collection version (or in a specific area within it). $page-&gt;add($pt, $data, $template = false) Adds a new page of a certain type, using a passed associate array to setup value. $data may contain any or all of the following: &quot;uID&quot;: User ID of the page's owner &quot;pkgID&quot;: Package ID the page belongs to &quot;cName&quot;: The name of the page &quot;cHandle&quot;: The handle of the page as used in the path &quot;cDatePublic&quot;: The date assigned to the page. $page-&gt;delete() $page-&gt;moveToTrash()","tags":"","url":"Pages\/Overview.html"},{"title":"Listing & Searching","text":"The PageList class provides an object-oriented way to search pages. use Concrete\\Core\\Page\\PageList; $list = new PageList; Basic Example Getting All Results $list = new \\Concrete\\Core\\Page\\PageList(); $pages = $list-&gt;getResults(); Basic Example with Pagination $list = new \\Concrete\\Core\\Page\\PageList(); $pagination = $list-&gt;getPagination(); $pagination-&gt;setMaxPerPage(10)-&gt;setCurrentPage(2); $results = $pagination-&gt;getCurrentPageResults(); Debug Methods $list-&gt;debug() $list-&gt;debugStart() $list-&gt;debugStop() Filtering Methods $list-&gt;filterByParentID(array $cParentID) Filters pages by the parent ID of a given page. $list-&gt;filterByPageTypeHandle(mixed $ptHandle) Filters by page type handles. $ctHandle can also be an array of page type handles. $list-&gt;filterByPageTemplate(Template $template) $list-&gt;filterByAttribute($handle, $value, $comparison = '=') Filters by attribute. $list-&gt;filterByPublicDate($date, $comparison = '=') $list-&gt;filterByDateAdded($date, $comparison = '=') $list-&gt;filterByDateLastModified($date, string $comparison = '=') $list-&gt;filterByNumberOfChildren($number, string $comparison = '&gt;') $list-&gt;filterByKeywords($keywords) Filtering by keywords performs a simple LIKE query against the name, description or text content of a page, as well as the textual representation of any page attributes that have been marked as &quot;included in search index&quot;. $list-&gt;filterByFulltextKeywords($keywords) Filters files by keywords, which searches: Name, Description, Indexed Content against MySQL fulltext functions Any collection attributes marked as being included in the search index $list-&gt;filterByPackage(Package $package) $list-&gt;filterBySite(Site $site) $list-&gt;includeSystemPages() Instructs the page list to include system pages (e.g. the dashboard). $list-&gt;ignorePermissions() When called, this will instruct the PageList query that you don't want to check the permissions of the logged-in user. This may result in the page list including pages that user cannot view. $list-&gt;includeAliases() Instructs the page list to ignore aliased pages. Sorting Methods $list-&gt;sortByDisplayOrder() Sorts this list by display order. $list-&gt;sortByDisplayOrderDescending() Sorts this list by display order descending. $list-&gt;sortByDateModified() Sorts this list by date modified ascending. $list-&gt;sortByDateModifiedDescending() Sorts this list by date modified descending. $list-&gt;sortByCollectionIDAscending() Sorts by ID in ascending order. $list-&gt;sortByPublicDate() Sorts this list by public date ascending order. $list-&gt;sortByName() Sorts by name in ascending order. $list-&gt;sortByNameDescending() Sorts by name in descending order. $list-&gt;sortByPublicDateDescending() Sorts this list by public date descending order. $list-&gt;sortByRelevance() Sorts by fulltext relevance (requires that the query be fulltext-based. $list-&gt;sortBy($field, $direction = 'asc') $list-&gt;executeSortBy($column, $direction = 'asc') $list-&gt;sortBySearchColumn(Column $column, $direction = null) Getting Results $list-&gt;setItemsPerPage($itemsPerPage) $list-&gt;getTotalResults() $list-&gt;getResults() Once you have filtered your PageList object, getResults() will return all matching pages. $list-&gt;getResult($queryRow) Pagination $pagination = $list-&gt;getPagination(); $pagination-&gt;setMaxPerPage($itemsPerPage); $pagination-&gt;setCurrentPage($pageNumber); $pagination-&gt;getTotalResults(); To get the total number of results $pagination-&gt;getTotalPages(); To get the total number of pages $pagination-&gt;hasNextPage(); $pagination-&gt;hasPreviousPage(); To determine whether paging is necessary $pagination-&gt;renderDefaultView(); Several common pagination styles are built-in, including Bootstrap 2, Bootstrap 3, Basic Pagination, and Concrete5's default styling (which is heavily Bootstrap 3 inspired). $results = $pagination-&gt;getCurrentPageResults();","tags":"","url":"Pages\/Listing_&_Searching.html"},{"title":"Single Pages","text":"","tags":"","url":"Pages\/Single_Pages.html"},{"title":"Page Types","text":"","tags":"","url":"Pages\/Page_Types.html"}]}